Plan for **staging** is ready.
**Branch/Commit:** refs/heads/staging / b1f194922847374afc4db78f348fd76684b68532
**Run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/19658447157

**Plan (last ~500 lines):**
```
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:AuthorizeSecurityGroupEgress",
              + "ec2:AuthorizeSecurityGroupIngress",
              + "ec2:CreateSecurityGroup",
              + "ec2:CreateTags",
              + "ec2:DeleteSecurityGroup",
              + "ec2:DeleteTags",
              + "ec2:RevokeSecurityGroupEgress",
              + "ec2:RevokeSecurityGroupIngress",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:CreateListener",
              + "elasticloadbalancing:CreateLoadBalancer",
              + "elasticloadbalancing:CreateRule",
              + "elasticloadbalancing:CreateTargetGroup",
              + "elasticloadbalancing:DeleteListener",
              + "elasticloadbalancing:DeleteLoadBalancer",
              + "elasticloadbalancing:DeleteRule",
              + "elasticloadbalancing:DeleteTargetGroup",
              + "elasticloadbalancing:DeregisterTargets",
              + "elasticloadbalancing:RegisterTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:AddTags",
              + "elasticloadbalancing:RemoveTags",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:AddListenerCertificates",
              + "elasticloadbalancing:ModifyListener",
              + "elasticloadbalancing:ModifyLoadBalancerAttributes",
              + "elasticloadbalancing:ModifyRule",
              + "elasticloadbalancing:ModifyTargetGroup",
              + "elasticloadbalancing:ModifyTargetGroupAttributes",
              + "elasticloadbalancing:RemoveListenerCertificates",
              + "elasticloadbalancing:SetIpAddressType",
              + "elasticloadbalancing:SetSecurityGroups",
              + "elasticloadbalancing:SetSubnets",
              + "elasticloadbalancing:SetWebAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:CreateServiceLinkedRole",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "elasticloadbalancing.amazonaws.com",
                ]
              + variable = "iam:AWSServiceName"
            }
        }
    }

  # module.helm.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.helm.data.aws_subnets.public will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_subnets" "public" {
      + id   = (known after apply)
      + ids  = (known after apply)
      + tags = (known after apply)

      + filter {
          + name   = "tag:kubernetes.io/cluster/platform-stg"
          + values = [
              + "shared",
            ]
        }
      + filter {
          + name   = "tag:kubernetes.io/role/elb"
          + values = [
              + "1",
            ]
        }
      + filter {
          + name   = "vpc-id"
          + values = [
              + "vpc-0a70acbb21ce13437",
            ]
        }
    }

  # module.helm.aws_iam_policy.external_dns_policy["this"] will be updated in-place
  ~ resource "aws_iam_policy" "external_dns_policy" {
        id               = "arn:aws:iam::107363237542:policy/eks/platform-stg/platform-stg-external-dns"
        name             = "platform-stg-external-dns"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "route53:ChangeResourceRecordSets"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::hostedzone/*"
                    },
                  - {
                      - Action   = [
                          - "route53:ListTagsForResource",
                          - "route53:ListResourceRecordSets",
                          - "route53:ListHostedZones",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "stg"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (7 unchanged attributes hidden)
    }

  # module.helm.aws_iam_policy.load_balancer_controller_policy["this"] will be updated in-place
  ~ resource "aws_iam_policy" "load_balancer_controller_policy" {
        id               = "arn:aws:iam::107363237542:policy/eks/platform-stg/platform-stg-lbc"
        name             = "platform-stg-lbc"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "elasticloadbalancing:DescribeTargetHealth",
                          - "elasticloadbalancing:DescribeTargetGroups",
                          - "elasticloadbalancing:DescribeTargetGroupAttributes",
                          - "elasticloadbalancing:DescribeTags",
                          - "elasticloadbalancing:DescribeSSLPolicies",
                          - "elasticloadbalancing:DescribeRules",
                          - "elasticloadbalancing:DescribeLoadBalancers",
                          - "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          - "elasticloadbalancing:DescribeListeners",
                          - "elasticloadbalancing:DescribeListenerCertificates",
                          - "elasticloadbalancing:DescribeListenerAttributes",
                          - "ec2:GetCoipPoolUsage",
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeInternetGateways",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeCoipPools",
                          - "ec2:DescribeAvailabilityZones",
                          - "ec2:DescribeAddresses",
                          - "ec2:DescribeAccountAttributes",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "wafv2:GetWebACLForResource",
                          - "wafv2:GetWebACL",
                          - "wafv2:DisassociateWebACL",
                          - "wafv2:AssociateWebACL",
                          - "waf-regional:GetWebACLForResource",
                          - "waf-regional:GetWebACL",
                          - "waf-regional:DisassociateWebACL",
                          - "waf-regional:AssociateWebACL",
                          - "shield:ListProtections",
                          - "shield:GetSubscriptionState",
                          - "shield:DescribeSubscription",
                          - "shield:DescribeProtection",
                          - "shield:DeleteProtection",
                          - "shield:CreateProtection",
                          - "iam:ListServerCertificates",
                          - "iam:GetServerCertificate",
                          - "cognito-idp:DescribeUserPoolClient",
                          - "acm:ListCertificates",
                          - "acm:DescribeCertificate",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ec2:RevokeSecurityGroupIngress",
                          - "ec2:RevokeSecurityGroupEgress",
                          - "ec2:DeleteTags",
                          - "ec2:DeleteSecurityGroup",
                          - "ec2:CreateTags",
                          - "ec2:CreateSecurityGroup",
                          - "ec2:AuthorizeSecurityGroupIngress",
                          - "ec2:AuthorizeSecurityGroupEgress",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:RegisterTargets",
                          - "elasticloadbalancing:DeregisterTargets",
                          - "elasticloadbalancing:DeleteTargetGroup",
                          - "elasticloadbalancing:DeleteRule",
                          - "elasticloadbalancing:DeleteLoadBalancer",
                          - "elasticloadbalancing:DeleteListener",
                          - "elasticloadbalancing:CreateTargetGroup",
                          - "elasticloadbalancing:CreateRule",
                          - "elasticloadbalancing:CreateLoadBalancer",
                          - "elasticloadbalancing:CreateListener",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:RemoveTags",
                          - "elasticloadbalancing:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:SetWebAcl",
                          - "elasticloadbalancing:SetSubnets",
                          - "elasticloadbalancing:SetSecurityGroups",
                          - "elasticloadbalancing:SetIpAddressType",
                          - "elasticloadbalancing:RemoveListenerCertificates",
                          - "elasticloadbalancing:ModifyTargetGroupAttributes",
                          - "elasticloadbalancing:ModifyTargetGroup",
                          - "elasticloadbalancing:ModifyRule",
                          - "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          - "elasticloadbalancing:ModifyListener",
                          - "elasticloadbalancing:AddListenerCertificates",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "iam:CreateServiceLinkedRole"
                      - Condition = {
                          - StringEquals = {
                              - "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "stg"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (7 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_ebs_csi_controller["this"] will be updated in-place
  ~ resource "aws_iam_role" "eks_ebs_csi_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::107363237542:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "platform-stg-ebs-csi"
        name                  = "platform-stg-ebs-csi"
        tags                  = {
            "Environment" = "stg"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (11 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_external_dns["this"] will be updated in-place
  ~ resource "aws_iam_role" "eks_external_dns" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::107363237542:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "platform-stg-external-dns"
        name                  = "platform-stg-external-dns"
        tags                  = {
            "Environment" = "stg"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (11 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_load_balancer_controller["this"] will be updated in-place
  ~ resource "aws_iam_role" "eks_load_balancer_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::107363237542:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2A7038AE3A9012C7E59F6F481F1A1435"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "platform-stg-lbc"
        name                  = "platform-stg-lbc"
        tags                  = {
            "Environment" = "stg"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (11 unchanged attributes hidden)
    }

  # module.helm.helm_release.aws_load_balancer_controller["this"] will be updated in-place
  ~ resource "helm_release" "aws_load_balancer_controller" {
        id                         = "aws-load-balancer-controller"
      ~ metadata                   = [
          - {
              - app_version    = "v2.16.0"
              - chart          = "aws-load-balancer-controller"
              - first_deployed = 1764042737
              - last_deployed  = 1764042737
              - name           = "aws-load-balancer-controller"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    AWS Load Balancer controller installed!
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - clusterName    = "platform-stg"
                      - region         = "us-east-1"
                      - serviceAccount = {
                          - annotations = {
                              - "eks.amazonaws.com/role-arn" = "arn:aws:iam::107363237542:role/eks/platform-stg/platform-stg-lbc"
                            }
                          - create      = false
                          - name        = "aws-load-balancer-controller"
                        }
                      - vpcId          = "vpc-0a70acbb21ce13437"
                    }
                )
              - version        = "1.16.0"
            },
        ] -> (known after apply)
        name                       = "aws-load-balancer-controller"
        # (26 unchanged attributes hidden)

      - set {
          - name  = "region" -> null
          - value = "us-east-1" -> null
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "region"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.helm.helm_release.ingress_nginx["this"] will be created
  + resource "helm_release" "ingress_nginx" {
      + atomic                     = true
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "ingress-nginx"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = true
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "controller":
                  "service":
                    "annotations":
                      "service.beta.kubernetes.io/aws-load-balancer-nlb-target-type": "ip"
                      "service.beta.kubernetes.io/aws-load-balancer-scheme": "internet-facing"
                      "service.beta.kubernetes.io/aws-load-balancer-subnets": "subnet-022563ba9cba2480c,subnet-0e8db1db3de0d1abf"
                      "service.beta.kubernetes.io/aws-load-balancer-type": "nlb"
            EOT,
        ]
      + verify                     = false
      + version                    = "4.13.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.network.helm_release.cilium will be updated in-place
  ~ resource "helm_release" "cilium" {
        id                         = "cilium"
        name                       = "cilium"
      ~ status                     = "failed" -> "deployed"
        # (27 unchanged attributes hidden)

        # (20 unchanged blocks hidden)
    }

Plan: 1 to add, 7 to change, 0 to destroy.
```
